let n =  new Date();
let y = n.getFullYear();
let m = n.getMonth() + 1;
let d = n.getDate();
let w = n.getDay();
document.getElementById("date").innerHTML = d + "." + m + "." + y;
let warStart = new Date('2022-02-24');
let warDuration = (n - warStart) / (1000 * 3600 * 24);
document.getElementById("duration").innerHTML = Math.floor(warDuration);

const quotes = [
  '<div>“Народ, що не знає своєї історії, є народ сліпців.”</div>— Олександр Довженко',
  '<div>“Україна починається з тебе.”</div>— Вячеслав Чорновіл',
  '<div>“Можеш вибирати друзів і дружину, вибрати не можеш тільки Батьківщину ”</div>— Василь Симоненко',
  '<div>“Щастя – це трикутник, а в нім три боки: віра, надія, любов. Тиша - це мова, якою до людини говорить Бог”</div>— Богдан Ігор-Антонич',
  '<div>“Ще не вмерла Україна, але може вмерти: ви самі її, ледачі, ведете до смерті!”</div>— Борис Грінченко',
  '<div>“Якщо ви вдало виберете справу і вкладете в неї всю свою душу, то щастя саме відшукає вас.”</div>— Костянтин Ушинський',
  '<div>“А хто з приятеля перекинувся в ворога, той, значить, і раніше не був приятелем і не буде.”</div>— Іван Франко',
  '<div>“Не бійся правди, хоч яка гірка, не бійся смутків, хоч вони як ріки. Людині бійся душу ошукать, бо в цьому схибиш - то уже навіки.”</div>— Ліна Костенко',
  '<div>“Жоден вогонь, жоден вогонь не горить так гаряче, як таємне кохання, про яке ніхто нічого не знає.”</div>— Іван Франко',
  '<div>“Мова зникає, коли нею не говорять про любов.”</div>— Сергій Жадан',
  '<div>“Доки на світі будуть закохані, журитись нічого.</div>– Олесь Гончар',
  '<div>“Якщо болить серце, тобі, друже, поталанило.”<br>– Василь Стус',
  '<div>“Не можна, мабуть, інакше, як тілько горем та бідою довести людей до розуму.”</div>– Пантелеймон Куліш',
  '<div>“Хто в себе не вірить, тому ніхто другий не повірить ”</div>– Володимир Винниченко',
  '<div>“Коли любиш - люди серцем, а не язиком. Шукають щастя нещасливі. ”</div>– Леонід Глібов',
  '<div>“Живучи в світі, що створюєш, не бачиш світу, що довкола. ”</div>– Володимир Канівець',
  '<div>“Не дуже довіряй свому серцю - сей віщун часто обманює.”</div>– Іван Котляревський',
  '<div>“Слава ворогові, що твоєї ненависті вартий. ”</div>– Олег Ольжич',
  '<div>“Шануй мудрість, а не золото. ”</div>– Мелетій Смотрицький',
  '<div>“За здобутком завжди втрата простує.”</div>– Богдан Хмельницький'
]

let randomNumber = Math.floor(Math.random() * 21);

document.getElementById("rand-quote").innerHTML = quotes[randomNumber];